gifts = ["Елка", "Печенье", "Шоколадка", "Трансформатор",
         "152 милиметровый шоколадно-печеньковый снаряд",
         "избалолист", "SCP-173", "тирокс"]
santa = ["Sonic", "Влад", "танк Т-34", "мистера бист",
         "избалолист", "SCP-173", "тирокс"]
place = ["Кладбище тамагочи", "школа", "эндер мир",
         "магазин", "пиццерия фредди", "заброшка"]

import random

gift1 = random.choice(gifts)
cha = random.choice(santa)
location = random.choice(place)
name = input("Ваше имя:")
print(f"{name}")
print(f"Вы получите на новый год в качестве подарка {gift1}")
print(f"Вас поздравит {cha} когда вы будете в {location}")
